org-init.org
#+OPTIONS: ':nil *:t -:t ::t <:t H:3 \n:nil ^:t arch:headline
#+OPTIONS: author:t broken-links:nil c:nil creator:nil
#+OPTIONS: d:(not "LOGBOOK") date:t e:t email:nil f:t inline:t num:t
#+OPTIONS: p:nil pri:nil prop:nil stat:t tags:t tasks:t tex:t
#+OPTIONS: timestamp:t title:t toc:t todo:t |:t
#+TITLE: init-org
#+DATE: <2019-07-27 Sat>
#+AUTHOR: Ethan Lin
#+EMAIL: e.yflin@gmail.com
#+LANGUAGE: en
#+SELECT_TAGS: export
#+EXCLUDE_TAGS: noexport
#+CREATOR: Emacs 26.1 (Org mode 9.1.9)
#+STARTUP: content


* init.el settings
** Cask Package Management
#+BEGIN_SRC emacs-lisp
(require 'cask "~/.cask/cask.el")
(cask-initialize)

(require 'pallet)
(pallet-mode t)
#+END_SRC
** Load Emacs path
#+BEGIN_SRC emacs-lisp
(add-to-list 'load-path "~/.emacs.d/lisp/")
#+END_SRC
** Load Require files
#+BEGIN_SRC emacs-lisp
(require 'use-package)
#+END_SRC
#+BEGIN_SRC emacs-lisp
(require 'init-packages)
(require 'init-better-defaults)
(require 'init-ui)
(require 'init-org)
(require 'init-javascript)
(require 'init-abbrev)
(require 'init-latex)
(require 'init-mapping)
(require 'init-org2blog)
(require 'init-easypg)
(require 'init-web-development)
(require 'init-package-configuration)
(require 'init-keybindings)
(require 'init-site)
(require 'init-filemanage)
;;(require 'grid-mode)
#+END_SRC
** Load Custom settings
#+BEGIN_SRC emacs-lisp
(setq custom-file (expand-file-name "lisp/custom.el" user-emacs-directory))
(load-file custom-file)
#+END_SRC
** AutoLoad
#+BEGIN_SRC emacs-lisp
;;(centaur-tabs-mode t)
#+END_SRC
** exclude file
   - recentf
   - abbrev, a model (init-abbrev) can be found from wiki page
